Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
fter apply)
+       name   = "organizations/5046617773/cloudkms.disableBeforeDestroy"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["commerceorggovernance.disablePublicMarketplace"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/commerceorggovernance.disablePublicMarketplace"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["compute.disableAllIpv6"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.disableAllIpv6"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["compute.disableGlobalCloudArmorPolicy"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.disableGlobalCloudArmorPolicy"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["compute.disableGlobalLoadBalancing"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.disableGlobalLoadBalancing"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["compute.disableGlobalSelfManagedSslCertificate"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.disableGlobalSelfManagedSslCertificate"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["compute.disableGlobalSerialPortAccess"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.disableGlobalSerialPortAccess"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["compute.disableGuestAttributesAccess"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.disableGuestAttributesAccess"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["compute.disableHybridCloudIpv6"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.disableHybridCloudIpv6"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["compute.disableInstanceDataAccessApis"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.disableInstanceDataAccessApis"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["compute.disableInternetNetworkEndpointGroup"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.disableInternetNetworkEndpointGroup"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["compute.disableNestedVirtualization"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.disableNestedVirtualization"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["compute.disableNonFIPSMachineTypes"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.disableNonFIPSMachineTypes"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["compute.disableSerialPortAccess"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.disableSerialPortAccess"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["compute.disableSerialPortLogging"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.disableSerialPortLogging"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["compute.disableSshInBrowser"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.disableSshInBrowser"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["compute.disableVpcExternalIpv6"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.disableVpcExternalIpv6"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["compute.disableVpcInternalIpv6"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.disableVpcInternalIpv6"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["compute.enableComplianceMemoryProtection"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.enableComplianceMemoryProtection"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["compute.requireOsLogin"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.requireOsLogin"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["compute.requireShieldedVm"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.requireShieldedVm"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["compute.restrictXpnProjectLienRemoval"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.restrictXpnProjectLienRemoval"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["compute.setNewProjectDefaultToZonalDNSOnly"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.setNewProjectDefaultToZonalDNSOnly"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["compute.skipDefaultNetworkCreation"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.skipDefaultNetworkCreation"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["container.restrictNoncompliantDiagnosticDataAccess"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/container.restrictNoncompliantDiagnosticDataAccess"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["datastream.disablePublicConnectivity"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/datastream.disablePublicConnectivity"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["essentialcontacts.disableProjectSecurityContacts"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/essentialcontacts.disableProjectSecurityContacts"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["firestore.requireP4SAforImportExport"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/firestore.requireP4SAforImportExport"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["gcp.detailedAuditLoggingMode"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/gcp.detailedAuditLoggingMode"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["iam.automaticIamGrantsForDefaultServiceAccounts"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/iam.automaticIamGrantsForDefaultServiceAccounts"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["iam.disableAuditLoggingExemption"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/iam.disableAuditLoggingExemption"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["iam.disableServiceAccountCreation"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/iam.disableServiceAccountCreation"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["iam.disableServiceAccountKeyCreation"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/iam.disableServiceAccountKeyCreation"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["iam.disableServiceAccountKeyUpload"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/iam.disableServiceAccountKeyUpload"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["iam.disableWorkloadIdentityClusterCreation"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/iam.disableWorkloadIdentityClusterCreation"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["iam.restrictCrossProjectServiceAccountLienRemoval"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/iam.restrictCrossProjectServiceAccountLienRemoval"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["iap.requireGlobalIapWebDisabled"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/iap.requireGlobalIapWebDisabled"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["iap.requireRegionalIapWebDisabled"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/iap.requireRegionalIapWebDisabled"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["pubsub.enforceInTransitRegions"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/pubsub.enforceInTransitRegions"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["spanner.assuredWorkloadsAdvancedServiceControls"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/spanner.assuredWorkloadsAdvancedServiceControls"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["spanner.disableMultiRegionInstanceIfNoLocationSelected"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/spanner.disableMultiRegionInstanceIfNoLocationSelected"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["sql.disableDefaultEncryptionCreation"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/sql.disableDefaultEncryptionCreation"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["sql.restrictAuthorizedNetworks"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/sql.restrictAuthorizedNetworks"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["sql.restrictNoncompliantDiagnosticDataAccess"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/sql.restrictNoncompliantDiagnosticDataAccess"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["sql.restrictNoncompliantResourceCreation"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/sql.restrictNoncompliantResourceCreation"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["storage.publicAccessPrevention"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/storage.publicAccessPrevention"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["storage.secureHttpTransport"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/storage.secureHttpTransport"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_boolean_constraint["storage.uniformBucketLevelAccess"] will be created
+ resource "google_org_policy_policy" "default_deny_boolean_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/storage.uniformBucketLevelAccess"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               enforce = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["ainotebooks.accessMode"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/ainotebooks.accessMode"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["ainotebooks.environmentOptions"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/ainotebooks.environmentOptions"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["ainotebooks.restrictVpcNetworks"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/ainotebooks.restrictVpcNetworks"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["appengine.runtimeDeploymentExemption"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/appengine.runtimeDeploymentExemption"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["cloudbuild.allowedIntegrations"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/cloudbuild.allowedIntegrations"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["cloudfunctions.allowedIngressSettings"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/cloudfunctions.allowedIngressSettings"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["cloudfunctions.allowedVpcConnectorEgressSettings"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/cloudfunctions.allowedVpcConnectorEgressSettings"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["cloudfunctions.restrictAllowedGenerations"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/cloudfunctions.restrictAllowedGenerations"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["cloudkms.minimumDestroyScheduledDuration"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/cloudkms.minimumDestroyScheduledDuration"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["cloudscheduler.allowedTargetTypes"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/cloudscheduler.allowedTargetTypes"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["commerceorggovernance.marketplaceServices"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/commerceorggovernance.marketplaceServices"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["compute.allowedVlanAttachmentEncryption"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.allowedVlanAttachmentEncryption"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["compute.disablePrivateServiceConnectCreationForConsumers"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.disablePrivateServiceConnectCreationForConsumers"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["compute.requireSslPolicy"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.requireSslPolicy"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["compute.restrictCloudNATUsage"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.restrictCloudNATUsage"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["compute.restrictCrossProjectServices"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.restrictCrossProjectServices"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["compute.restrictDedicatedInterconnectUsage"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.restrictDedicatedInterconnectUsage"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["compute.restrictLoadBalancerCreationForTypes"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.restrictLoadBalancerCreationForTypes"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["compute.restrictNonConfidentialComputing"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.restrictNonConfidentialComputing"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["compute.restrictPartnerInterconnectUsage"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.restrictPartnerInterconnectUsage"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["compute.restrictPrivateServiceConnectConsumer"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.restrictPrivateServiceConnectConsumer"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["compute.restrictPrivateServiceConnectProducer"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.restrictPrivateServiceConnectProducer"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["compute.restrictProtocolForwardingCreationForTypes"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.restrictProtocolForwardingCreationForTypes"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["compute.restrictSharedVpcBackendServices"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.restrictSharedVpcBackendServices"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["compute.restrictSharedVpcHostProjects"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.restrictSharedVpcHostProjects"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["compute.restrictSharedVpcSubnetworks"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.restrictSharedVpcSubnetworks"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["compute.restrictVpcPeering"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.restrictVpcPeering"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["compute.restrictVpnPeerIPs"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.restrictVpnPeerIPs"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["compute.sharedReservationsOwnerProjects"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.sharedReservationsOwnerProjects"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["compute.storageResourceUseRestrictions"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.storageResourceUseRestrictions"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["compute.vmCanIpForward"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.vmCanIpForward"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["compute.vmExternalIpAccess"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.vmExternalIpAccess"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["dataform.restrictGitRemotes"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/dataform.restrictGitRemotes"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["essentialcontacts.allowedContactDomains"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/essentialcontacts.allowedContactDomains"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["iam.allowServiceAccountCredentialLifetimeExtension"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/iam.allowServiceAccountCredentialLifetimeExtension"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["iam.workloadIdentityPoolAwsAccounts"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/iam.workloadIdentityPoolAwsAccounts"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["iam.workloadIdentityPoolProviders"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/iam.workloadIdentityPoolProviders"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["meshconfig.allowedVpcscModes"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/meshconfig.allowedVpcscModes"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["resourcemanager.allowEnabledServicesForExport"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/resourcemanager.allowEnabledServicesForExport"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["resourcemanager.allowedExportDestinations"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/resourcemanager.allowedExportDestinations"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["resourcemanager.allowedImportSources"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/resourcemanager.allowedImportSources"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["run.allowedBinaryAuthorizationPolicies"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/run.allowedBinaryAuthorizationPolicies"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["run.allowedIngress"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/run.allowedIngress"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["run.allowedVPCEgress"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/run.allowedVPCEgress"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_list_constraint["storage.retentionPolicySeconds"] will be created
+ resource "google_org_policy_policy" "default_deny_list_constraint" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/storage.retentionPolicySeconds"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               deny_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.default_deny_services will be created
+ resource "google_org_policy_policy" "default_deny_services" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/serviceuser.services"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               values {
+                   denied_values = [
+                       "compute.googleapis.com",
+                       "deploymentmanager.googleapis.com",
+                       "dns.googleapis.com",
+                       "doubleclicksearch.googleapis.com",
+                       "replicapool.googleapis.com",
+                       "replicapoolupdater.googleapis.com",
+                       "resourceviews.googleapis.com",
                    ]
                }
            }
        }
    }

  # google_org_policy_policy.gcp_restrictCmekCryptoKeyProjects will be created
+ resource "google_org_policy_policy" "gcp_restrictCmekCryptoKeyProjects" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/gcp.restrictCmekCryptoKeyProjects"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               values {
+                   allowed_values = [
+                       "under:organizations/5046617773",
                    ]
                }
            }
        }
    }

  # google_org_policy_policy.gcp_restrictNonCmekServices will be created
+ resource "google_org_policy_policy" "gcp_restrictNonCmekServices" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/gcp.restrictNonCmekServices"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               values {
+                   denied_values = [
+                       "aiplatform.googleapis.com",
+                       "artifactregistry.googleapis.com",
+                       "bigquery.googleapis.com",
+                       "bigquerydatatransfer.googleapis.com",
+                       "bigtable.googleapis.com",
+                       "cloudfunctions.googleapis.com",
+                       "composer.googleapis.com",
+                       "compute.googleapis.com",
+                       "container.googleapis.com",
+                       "dataflow.googleapis.com",
+                       "dataproc.googleapis.com",
+                       "documentai.googleapis.com",
+                       "file.googleapis.com",
+                       "firestore.googleapis.com",
+                       "integrations.googleapis.com",
+                       "logging.googleapis.com",
+                       "notebooks.googleapis.com",
+                       "pubsub.googleapis.com",
+                       "run.googleapis.com",
+                       "secretmanager.googleapis.com",
+                       "spanner.googleapis.com",
+                       "sqladmin.googleapis.com",
+                       "storagetransfer.googleapis.com",
+                       "workstations.googleapis.com",
                    ]
                }
            }
        }
    }

  # google_org_policy_policy.gcp_restrictServiceUsage will be created
+ resource "google_org_policy_policy" "gcp_restrictServiceUsage" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/gcp.restrictServiceUsage"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               allow_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.iam_serviceAccountKeyExposureResponse will be created
+ resource "google_org_policy_policy" "iam_serviceAccountKeyExposureResponse" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/policies/iam.serviceAccountKeyExposureResponse"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               values {
+                   allowed_values = [
+                       "DISABLE_KEY",
                    ]
                }
            }
        }
    }

  # google_org_policy_policy.restrict_iam_to_org_domain will be created
+ resource "google_org_policy_policy" "restrict_iam_to_org_domain" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/iam.allowedPolicyMemberDomains"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               values {
+                   allowed_values = [
+                       "C042vfhik",
                    ]
                }
            }
        }
    }

  # google_org_policy_policy.storage_restrictAuthTypes will be created
+ resource "google_org_policy_policy" "storage_restrictAuthTypes" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/storage.restrictAuthTypes"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               allow_all = "TRUE"
            }
        }
    }

  # google_org_policy_policy.trusted_image_projects will be created
+ resource "google_org_policy_policy" "trusted_image_projects" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/compute.trustedImageProjects"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               values {
+                   allowed_values = [
+                       "projects/cos-cloud",
+                       "projects/ubuntu-os-cloud",
+                       "projects/trusted-builds",
                    ]
                }
            }
        }
    }

  # google_org_policy_policy.trusted_worker_pools will be created
+ resource "google_org_policy_policy" "trusted_worker_pools" {
+       etag   = (known after apply)
+       id     = (known after apply)
+       name   = "organizations/5046617773/cloudbuild.allowedWorkerPools"
+       parent = "organizations/5046617773"

+       spec {
+           etag        = (known after apply)
+           update_time = (known after apply)

+           rules {
+               values {
+                   allowed_values = [
+                       "under:projects/trusted-builds",
                    ]
                }
            }
        }
    }

  # google_organization_iam_policy.organization will be updated in-place
! resource "google_organization_iam_policy" "organization" {
        id          = "5046617773"
!       policy_data = jsonencode(
!           {
!               bindings = [
                    {
                        members = [
                            "serviceAccount:service-org-5046617773@security-center-api.iam.gserviceaccount.com",
                        ]
                        role    = "roles/cloudfunctions.serviceAgent"
                    },
!                   {
!                       members = [
                            "group:cloud@pulsifer.ca",
-                           "serviceAccount:project-importer@moonpay-tss.iam.gserviceaccount.com",
                        ]
                        # (1 unchanged attribute hidden)
                    },
                    {
                        members = [
                            "group:cloud@pulsifer.ca",
                        ]
                        role    = "roles/owner"
                    },
                    # (2 unchanged elements hidden)
                    {
                        members = [
                            "group:cloud@pulsifer.ca",
                        ]
                        role    = "roles/resourcemanager.projectCreator"
                    },
-                   {
-                       members = [
-                           "serviceAccount:project-importer@moonpay-tss.iam.gserviceaccount.com",
                        ]
-                       role    = "roles/resourcemanager.projectIamAdmin"
                    },
-                   {
-                       members = [
-                           "serviceAccount:project-importer@moonpay-tss.iam.gserviceaccount.com",
                        ]
-                       role    = "roles/resourcemanager.projectMover"
                    },
                    {
                        members = [
                            "serviceAccount:service-org-5046617773@security-center-api.iam.gserviceaccount.com",
                        ]
                        role    = "roles/securitycenter.serviceAgent"
                    },
                    # (1 unchanged element hidden)
                ]
            }
        )
        # (2 unchanged attributes hidden)
    }

Plan: 118 to add, 1 to change, 0 to destroy.
```
</details>

This plan was not saved because one or more projects failed and automerge requires all plans pass.
Plan: 118 to add, 1 to change, 0 to destroy.

---
### 4. dir: `gcp/projects/jonpulsifer` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
! update in-place

Terraform will perform the following actions:

  # google_project_service.project will be updated in-place
! resource "google_project_service" "project" {
-       disable_on_destroy         = true -> null
        id                         = "jonpulsifer/sourcerepo.googleapis.com"
        # (3 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

This plan was not saved because one or more projects failed and automerge requires all plans pass.
Plan: 0 to add, 1 to change, 0 to destroy.

---
### 9. dir: `workspace` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/local/bin/terraform plan -input=false -refresh -out "/atlantis-data/repos/jonpulsifer/infra/326/default/workspace/default.tfplan"' in '/atlantis-data/repos/jonpulsifer/infra/326/default/workspace': exit status 1
ephemeral.google_service_account_access_token.terraform: Opening...

Planning failed. Terraform encountered an error while generating this plan.

╷
│ Error: Error generating access token
│ 
│   with ephemeral.google_service_account_access_token.terraform,
│   on versions.tf line 15, in ephemeral "google_service_account_access_token" "terraform":
│   15: ephemeral "google_service_account_access_token" "terraform" {
│ 
│ Error generating access token: googleapi: Error 400: Precondition check
│ failed., failedPrecondition
╵


```
</details>

---
### Plan Summary

9 projects, 2 with changes, 6 with no changes, 1 failed